---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.GenericZone
source: html/4275c3c2-6eb9-1291-52ca-cadf96acc1be.htm
---
# GenericZone Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.